Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/samd20b/atdf/ATSAMD20J14B.atdf
      <value-group name="EIC_NMICTRL__NMISENSE">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising-edge detection" value="1"/>
        <value name="FALL" caption="Falling-edge detection" value="2"/>
        <value name="BOTH" caption="Both-edges detection" value="3"/>
        <value name="HIGH" caption="High-level detection" value="4"/>
        <value name="LOW" caption="Low-level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE0">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising-edge detection" value="1"/>
        <value name="FALL" caption="Falling-edge detection" value="2"/>
        <value name="BOTH" caption="Both-edges detection" value="3"/>
        <value name="HIGH" caption="High-level detection" value="4"/>
        <value name="LOW" caption="Low-level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE1">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE2">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE3">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE4">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE5">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE6">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE7">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
    </module>
    <module name="EVSYS" id="U2208" version="1.0.1" caption="Event System Interface">
      <register-group name="EVSYS" caption="Event System Interface">
        <register name="CTRL" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="GCLKREQ" caption="Generic Clock Requests" mask="0x10"/>
        </register>
        <register name="CHANNEL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Channel">
          <bitfield name="CHANNEL" caption="Channel Selection" mask="0x7"/>
          <bitfield name="SWEVT" caption="Software Event" mask="0x100"/>
          <bitfield name="EVGEN" caption="Event Generator Selection" mask="0x3F0000"/>
          <bitfield name="PATH" caption="Path Selection" mask="0x3000000" values="EVSYS_CHANNEL__PATH"/>
          <bitfield name="EDGSEL" caption="Edge Detection Selection" mask="0xC000000" values="EVSYS_CHANNEL__EDGSEL"/>
        </register>
        <register name="USER" offset="0x8" rw="RW" size="2" initval="0x0000" caption="User Multiplexer">
          <bitfield name="USER" caption="User Multiplexer Selection" mask="0xF"/>
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0xF00" values="EVSYS_USER__CHANNEL"/>
        </register>
        <register name="CHSTATUS" offset="0xC" rw="R" size="4" initval="0x000F00FF" caption="Channel Status">
          <bitfield name="USRRDY0" caption="Channel 0 User Ready" mask="0x1"/>
          <bitfield name="USRRDY1" caption="Channel 1 User Ready" mask="0x2"/>
          <bitfield name="USRRDY2" caption="Channel 2 User Ready" mask="0x4"/>
          <bitfield name="USRRDY3" caption="Channel 3 User Ready" mask="0x8"/>
          <bitfield name="USRRDY4" caption="Channel 4 User Ready" mask="0x10"/>
          <bitfield name="USRRDY5" caption="Channel 5 User Ready" mask="0x20"/>
          <bitfield name="USRRDY6" caption="Channel 6 User Ready" mask="0x40"/>
          <bitfield name="USRRDY7" caption="Channel 7 User Ready" mask="0x80"/>
          <bitfield name="CHBUSY0" caption="Channel 0 Busy" mask="0x100"/>
          <bitfield name="CHBUSY1" caption="Channel 1 Busy" mask="0x200"/>
          <bitfield name="CHBUSY2" caption="Channel 2 Busy" mask="0x400"/>
          <bitfield name="CHBUSY3" caption="Channel 3 Busy" mask="0x800"/>
          <bitfield name="CHBUSY4" caption="Channel 4 Busy" mask="0x1000"/>
          <bitfield name="CHBUSY5" caption="Channel 5 Busy" mask="0x2000"/>
          <bitfield name="CHBUSY6" caption="Channel 6 Busy" mask="0x4000"/>
          <bitfield name="CHBUSY7" caption="Channel 7 Busy" mask="0x8000"/>
        </register>
        <register name="INTENCLR" offset="0x10" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="OVR0" caption="Channel 0 Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun Interrupt Enable" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun Interrupt Enable" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun Interrupt Enable" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun Interrupt Enable" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun Interrupt Enable" mask="0x80"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection Interrupt Enable" mask="0x100"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection Interrupt Enable" mask="0x200"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection Interrupt Enable" mask="0x400"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection Interrupt Enable" mask="0x800"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection Interrupt Enable" mask="0x1000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection Interrupt Enable" mask="0x2000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection Interrupt Enable" mask="0x4000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection Interrupt Enable" mask="0x8000"/>
        </register>
        <register name="INTENSET" offset="0x14" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="OVR0" caption="Channel 0 Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun Interrupt Enable" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun Interrupt Enable" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun Interrupt Enable" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun Interrupt Enable" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun Interrupt Enable" mask="0x80"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection Interrupt Enable" mask="0x100"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection Interrupt Enable" mask="0x200"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection Interrupt Enable" mask="0x400"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection Interrupt Enable" mask="0x800"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection Interrupt Enable" mask="0x1000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection Interrupt Enable" mask="0x2000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection Interrupt Enable" mask="0x4000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection Interrupt Enable" mask="0x8000"/>
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVR0" caption="Channel 0 Overrun" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun" mask="0x80"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection" mask="0x100"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection" mask="0x200"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection" mask="0x400"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection" mask="0x800"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection" mask="0x1000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection" mask="0x2000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection" mask="0x4000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection" mask="0x8000"/>
        </register>
      </register-group>
      <value-group name="EVSYS_CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0"/>
        <value name="RISING_EDGE" caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" value="1"/>
        <value name="FALLING_EDGE" caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" value="2"/>
        <value name="BOTH_EDGES" caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" value="3"/>
      </value-group>
      <value-group name="EVSYS_CHANNEL__PATH">
        <value name="SYNCHRONOUS" caption="Synchronous path" value="0"/>
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="1"/>
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="2"/>
      </value-group>
      <value-group name="EVSYS_USER__CHANNEL">
        <value name="0" caption="No Channel Output Selected" value="0"/>
      </value-group>
    </module>
    <module name="GCLK" id="U2102" version="2.1.0" caption="Generic Clock Generator">
      <register-group name="GCLK" caption="Generic Clock Generator">
        <register name="CTRL" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="STATUS" offset="0x1" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="SYNCBUSY" caption="Synchronization Busy Status" mask="0x80"/>
        </register>
        <register name="CLKCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Generic Clock Control">
          <bitfield name="ID" caption="Generic Clock Selection ID" mask="0x3F" values="GCLK_CLKCTRL__ID"/>
          <bitfield name="GEN" caption="Generic Clock Generator" mask="0xF00" values="GCLK_CLKCTRL__GEN"/>
          <bitfield name="CLKEN" caption="Clock Enable" mask="0x4000"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x8000"/>
        </register>
